adamkondraciuk/nrfx/mdk/iar_startup_nrf54h20_engb_bbpr.s
        PUBWEAK  EGU020_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
EGU020_IRQHandler
        j .

        PUBWEAK  AAR020_CCM020_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
AAR020_CCM020_IRQHandler
        j .

        PUBWEAK  GPIOTE_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOTE_IRQHandler
        j .

        PUBWEAK  TIMER020_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER020_IRQHandler
        j .

        PUBWEAK  TIMER021_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER021_IRQHandler
        j .

        PUBWEAK  TIMER022_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER022_IRQHandler
        j .

        PUBWEAK  RTC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RTC_IRQHandler
        j .

        PUBWEAK  RADIO_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RADIO_1_IRQHandler
        j .

        PUBWEAK  SPU030_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU030_IRQHandler
        j .

        PUBWEAK  RADIOACC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RADIOACC_IRQHandler
        j .

        PUBWEAK  AAR030_CCM030_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
AAR030_CCM030_IRQHandler
        j .

        PUBWEAK  ECB030_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
ECB030_IRQHandler
        j .

        PUBWEAK  AAR031_CCM031_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
AAR031_CCM031_IRQHandler
        j .

        PUBWEAK  ECB031_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
ECB031_IRQHandler
        j .

        PUBWEAK  IPCT_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
IPCT_0_IRQHandler
        j .

        PUBWEAK  IPCT_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
IPCT_1_IRQHandler
        j .

        PUBWEAK  GPIOTE130_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOTE130_0_IRQHandler
        j .

        PUBWEAK  GPIOTE130_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOTE130_1_IRQHandler
        j .

        PUBWEAK  GRTC_3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_3_IRQHandler
        j .

        PUBWEAK  GRTC_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_1_IRQHandler
        j .

        PUBWEAK  GRTC_2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_2_IRQHandler
        j .

        PUBWEAK  TBM_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TBM_IRQHandler
        j .

        PUBWEAK  USBHS_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
USBHS_IRQHandler
        j .

        PUBWEAK  MRAMC110_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MRAMC110_IRQHandler
        j .

        PUBWEAK  MRAMC111_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MRAMC111_IRQHandler
        j .

        PUBWEAK  EXMIF_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
EXMIF_IRQHandler
        j .

        PUBWEAK  OTPC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
OTPC_IRQHandler
        j .

        PUBWEAK  VPR120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPR120_IRQHandler
        j .

        PUBWEAK  IPCT120_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
IPCT120_0_IRQHandler
        j .

        PUBWEAK  I3C120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
I3C120_IRQHandler
        j .

        PUBWEAK  VPR121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPR121_IRQHandler
        j .

        PUBWEAK  CAN120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
CAN120_IRQHandler
        j .

        PUBWEAK  MVDMA120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MVDMA120_IRQHandler
        j .

        PUBWEAK  I3C121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
I3C121_IRQHandler
        j .

        PUBWEAK  TIMER120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER120_IRQHandler
        j .

        PUBWEAK  TIMER121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER121_IRQHandler
        j .

        PUBWEAK  PWM120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PWM120_IRQHandler
        j .

        PUBWEAK  SPIS120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPIS120_IRQHandler
        j .

        PUBWEAK  SPIM120_UARTE120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPIM120_UARTE120_IRQHandler
        j .

        PUBWEAK  SPIM121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPIM121_IRQHandler
        j .

        PUBWEAK  VPR130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPR130_IRQHandler
        j .

        PUBWEAK  IPCT130_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
IPCT130_0_IRQHandler
        j .

        PUBWEAK  RTC130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RTC130_IRQHandler
        j .

        PUBWEAK  RTC131_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RTC131_IRQHandler
        j .

        PUBWEAK  WDT131_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
WDT131_IRQHandler
        j .

        PUBWEAK  WDT132_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
WDT132_IRQHandler
        j .

        PUBWEAK  EGU130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
EGU130_IRQHandler
        j .

        PUBWEAK  RESETHUB_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RESETHUB_IRQHandler
        j .

        PUBWEAK  SAADC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SAADC_IRQHandler
        j .

        PUBWEAK  COMP_LPCOMP_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
COMP_LPCOMP_IRQHandler
        j .

        PUBWEAK  TEMP_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TEMP_IRQHandler
        j .

        PUBWEAK  NFCT_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
NFCT_IRQHandler
        j .

        PUBWEAK  TDM130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TDM130_IRQHandler
        j .

        PUBWEAK  PDM_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PDM_IRQHandler
        j .

        PUBWEAK  QDEC130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
QDEC130_IRQHandler
        j .

